# Дано целое число N (>0). Найти наибольшее целое число K, квадрат которого не
# превосходит N: K2 < N. Функцию извлечения квадратного корня не использовать

while True:
    try:
        n = int(input("Введите положительное целое число N: "))
        if n > 0:
            break
        print("Число должно быть больше нуля!")
    except ValueError:
        print("Неправильный ввод! Это должно быть целое положительное число")

k = 0

while (k + 1) ** 2 < n:
    k += 1

print("Наибольшее целое  число K:", k)
