# 2. Единицы массы пронумерованы следующим образом: 1 — килограмм,
# 2 — миллиграмм, 3 — грамм, 4 — тонна, 5 — центнер. Дан номер
# единицы массы (целое число в диапазоне 1-5) и mass тела в этих
# единицах (вещественное число). Найти массу тела в килограммах.

try:
    unit = int(input("Введите номер единицы массы (1-5): "))
    mass = int(input("Введите массу: "))

    if unit == 1:
        kg_mass = mass  # килограмм
    elif unit == 2:
        kg_mass = mass / 1000000  # миллиграмм
    elif unit == 3:
        kg_mass = mass / 1000  # грамм
    elif unit == 4:
        kg_mass = mass * 1000  # тонна
    elif unit == 5:
        kg_mass = mass * 100  # центнер
    else:
        print("Вы ввели некорректный номер единицы массы.")

    print(kg_mass)

except ValueError:
    print("Ошибка! Введите число!")